cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32TG11B320F128IQ48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USART2</name>
      <version>5.7.0</version>
      <description>USART2</description>
      <baseAddress>0x40010800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART2</name>
        <value>14</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF3FFFF7F</resetMask>
          <fields>
            <field>
              <name>SYNC</name>
              <description>USART Synchronous Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPBK</name>
              <description>Loopback Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCEN</name>
              <description>Collision Check Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPM</name>
              <description>Multi-Processor Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPAB</name>
              <description>Multi-Processor Address-Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVS</name>
              <description>Oversampling</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X16</name>
                  <description>Regular UART mode with 16X oversampling in asynchronous mode</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X8</name>
                  <description>Double speed with 8X oversampling in asynchronous mode</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X6</name>
                  <description>6X oversampling in asynchronous mode</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X4</name>
                  <description>Quadruple speed with 4X oversampling in asynchronous mode</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPOL</name>
              <description>Clock Polarity</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKPHA</name>
              <description>Clock Edge for Setup/Sample</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBF</name>
              <description>Most Significant Bit First</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA</name>
              <description>Action on Slave-Select in Master Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBIL</name>
              <description>TX Buffer Interrupt Level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINV</name>
              <description>Receiver Input Invert</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINV</name>
              <description>Transmitter Output Invert</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSINV</name>
              <description>Chip Select Invert</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOCS</name>
              <description>Automatic Chip Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOTRI</name>
              <description>Automatic TX Tristate</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCMODE</name>
              <description>SmartCard Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRETRANS</name>
              <description>SmartCard Retransmit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIPPERRF</name>
              <description>Skip Parity Error Frames</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT8DV</name>
              <description>Bit 8 Default Value</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRSDMA</name>
              <description>Halt DMA on Error</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRSRX</name>
              <description>Disable RX on Error</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRSTX</name>
              <description>Disable TX on Error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSSEARLY</name>
              <description>Synchronous Slave Setup Early</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTESWAP</name>
              <description>Byteswap in Double Accesses</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOTX</name>
              <description>Always Transmit When RX Not Full</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MVDIS</name>
              <description>Majority Vote Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSDELAY</name>
              <description>Synchronous Master Sample Delay</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME</name>
          <description>USART Frame Format Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001005</resetValue>
          <resetMask>0x0000330F</resetMask>
          <fields>
            <field>
              <name>DATABITS</name>
              <description>Data-Bit Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Each frame contains 4 data bits</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE</name>
                  <description>Each frame contains 5 data bits</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIX</name>
                  <description>Each frame contains 6 data bits</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <description>Each frame contains 7 data bits</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Each frame contains 8 data bits</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>Each frame contains 9 data bits</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN</name>
                  <description>Each frame contains 10 data bits</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVEN</name>
                  <description>Each frame contains 11 data bits</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <description>Each frame contains 12 data bits</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEEN</name>
                  <description>Each frame contains 13 data bits</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEEN</name>
                  <description>Each frame contains 14 data bits</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEEN</name>
                  <description>Each frame contains 15 data bits</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>Each frame contains 16 data bits</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARITY</name>
              <description>Parity-Bit Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Parity bits are not used</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVEN</name>
                  <description>Even parity are used. Parity bits are automatically generated and checked by hardware.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODD</name>
                  <description>Odd parity is used. Parity bits are automatically generated and checked by hardware.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPBITS</name>
              <description>Stop-Bit Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>The transmitter generates a half stop bit. Stop-bits are not verified by receiver</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>One stop bit is generated and verified</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEANDAHALF</name>
                  <description>The transmitter generates one and a half stop bit. The receiver verifies the first stop bit</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>The transmitter generates two stop bits. The receiver checks the first stop-bit only</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGCTRL</name>
          <description>USART Trigger Control Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00071FF0</resetMask>
          <fields>
            <field>
              <name>RXTEN</name>
              <description>Receive Trigger Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXTEN</name>
              <description>Transmit Trigger Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOTXTEN</name>
              <description>AUTOTX Trigger Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXARX0EN</name>
              <description>Enable Transmit Trigger After RX End of Frame Plus TCMP0VAL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXARX1EN</name>
              <description>Enable Transmit Trigger After RX End of Frame Plus TCMP1VAL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXARX2EN</name>
              <description>Enable Transmit Trigger After RX End of Frame Plus TCMP2VAL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXATX0EN</name>
              <description>Enable Receive Trigger After TX End of Frame Plus TCMPVAL0 Baud-times</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXATX1EN</name>
              <description>Enable Receive Trigger After TX End of Frame Plus TCMPVAL1 Baud-times</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXATX2EN</name>
              <description>Enable Receive Trigger After TX End of Frame Plus TCMPVAL2 Baud-times</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEL</name>
              <description>Trigger PRS Channel Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
